src/DataProcessors/Демо_КОД_Обработчик_ЗаказыВJSON.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<DataProcessor>
		<Properties>
			<Name>Демо_КОД_Обработчик_ЗаказыВJSON</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/Documents/Демо_Заказ.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>Демо_Заказ</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Склад</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Демо_КОД_СкладыХранения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Товары</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Товар</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Демо_КОД_Товары</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>3</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/DataProcessors/Демо_КОД_Обработчик_ЗаказыВJSON/Ext/ObjectModule.bsl
#Область ОписаниеПеременных

Перем СледующийОбработчик;

#КонецОбласти

#Область ПрограммныйИнтерфейс

// Возвращает сведения о внешней обработке для регистрации в подсистеме
// дополнительных отчетов и обработок.
//
// Возвращаемое значение:
//  Структура - параметры регистрации внешней обработки.
//
Функция СведенияОВнешнейОбработке() Экспорт

	//ПараметрыРегистрации =
	//	ДополнительныеОтчетыИОбработки.СведенияОВнешнейОбработке(
	//		СтандартныеПодсистемыСервер.ВерсияБиблиотеки());
	//
	//ПараметрыРегистрации.Вид =
	//	ДополнительныеОтчетыИОбработкиКлиентСервер.ВидОбработкиДополнительнаяОбработка();
	//ПараметрыРегистрации.Вставить("БезопасныйРежим", Ложь);
	//ПараметрыРегистрации.Версия = "1.0";
	//
	//Возврат ПараметрыРегистрации;

КонецФункции

// Устанавливает следующий обработчик цепочки или возвращает ранее установленный.
//
// Параметры:
//  Обработчик - ОбработкаОбъект, Неопределено - следующий обработчик цепочки.
//
// Возвращаемое значение:
//  ОбработкаОбъект, Неопределено - следующий обработчик цепочки.
Функция Следующий(Обработчик = Неопределено) Экспорт

	Если Обработчик <> Неопределено Тогда
		СледующийОбработчик = Обработчик;
	КонецЕсли;

	Возврат СледующийОбработчик;

КонецФункции

// Формирует сообщения для заказов, прошедших фильтрацию и маршрутизацию,
// заполняет получателей и передает сформированные сообщения следующему обработчику.
//
// Параметры:
//  Контекст - ФиксированнаяСтруктура - контекст выполнения конвейера.
//  Вход - Произвольный - результат предыдущего обработчика.
Процедура Обработать(Контекст, Вход = Неопределено) Экспорт

	Если Не КОД_ДиспетчерРегистрацииКОбмену.ВременнаяТаблицаСуществует(Контекст.Выполнение.МенеджерВременныхТаблиц, "ВТ_СсылкиПоУзлам") Тогда
		ВызватьИсключение "Нарушен контракт обработчика: отсутствует ВТ_СсылкиПоУзлам.";
	КонецЕсли;

	ТаблицаОбъектСообщение = Контекст.Данные.ТаблицаОбъектСообщение;

	Заголовки = Новый Соответствие;
	Заголовки["sync_type"] = "upsert";
	Заголовки["content_type"] = "order";
	Заголовки = Новый ФиксированноеСоответствие(Заголовки);

	СформироватьСообщения(Контекст);
	ЗаполнитьПолучателей(Контекст);

	Для Каждого СтрокаСообщения Из ТаблицаОбъектСообщение Цикл

		Выход = Новый ФиксированнаяСтруктура(
			Новый Структура(
				"Тело, Заголовки, Ссылка, Получатели",
				СтрокаСообщения.Сообщение, Заголовки, СтрокаСообщения.Ссылка, СтрокаСообщения.Получатели));

		ПередатьДругому(Контекст, Выход);

	КонецЦикла;

КонецПроцедуры

// Заполняет получателей сформированных сообщений на основании
// результатов маршрутизации.
//
// Параметры:
//  Контекст - ФиксированнаяСтруктура - контекст выполнения конвейера.
Процедура ЗаполнитьПолучателей(Контекст) Экспорт

	ТаблицаОбъектСообщение = Контекст.Данные.ТаблицаОбъектСообщение;

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Контекст.Выполнение.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	Маршруты.Ссылка КАК Ссылка,
		|	Маршруты.Узел КАК Получатель
		|ИЗ
		|	ВТ_СсылкиПоУзлам КАК Маршруты";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		СтрокаСообщения = ТаблицаОбъектСообщение.Найти(Выборка.Ссылка, "Ссылка");

		Если СтрокаСообщения = Неопределено Тогда
			Продолжить;
		КонецЕсли;

		Если СтрокаСообщения.Получатели = Неопределено Тогда
			СтрокаСообщения.Получатели = Новый Массив;
		КонецЕсли;

		СтрокаСообщения.Получатели.Добавить(Выборка.Получатель);

	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Формирует сообщения для заказов, прошедших маршрутизацию.
//
// Параметры:
//  Контекст - ФиксированнаяСтруктура - контекст выполнения конвейера.
Процедура СформироватьСообщения(Контекст)

	ТаблицаОбъектСообщение = Контекст.Данные.ТаблицаОбъектСообщение;
	СоставыЗаказов = ПолучитьСоставыЗаказов(Контекст);

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Контекст.Выполнение.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Заказы.Ссылка КАК Ссылка,
		|	Заказы.Номер КАК Номер,
		|	Заказы.Дата КАК Дата,
		|	Заказы.Проведен КАК Проведен,
		|	Заказы.Склад КАК Склад,
		|	Склады.Код КАК КодСклада,
		|	Склады.Наименование КАК НаименованиеСклада
		|ИЗ
		|	ВТ_СсылкиПоУзлам КАК Маршруты
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.Демо_Заказ КАК Заказы
		|		ПО Маршруты.Ссылка = Заказы.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Демо_КОД_СкладыХранения КАК Склады
		|		ПО Заказы.Склад = Склады.Ссылка";

	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		СтрокаСообщения = ТаблицаОбъектСообщение.Добавить();

		СтруктураЗаказа = Новый Структура;
		СтруктураЗаказа.Вставить("guid", Выборка.Ссылка.УникальныйИдентификатор());
		СтруктураЗаказа.Вставить("number", Выборка.Номер);
		СтруктураЗаказа.Вставить("date", Выборка.Дата);
		СтруктураЗаказа.Вставить("posted", Выборка.Проведен);
		СтруктураЗаказа.Вставить(
			"warehouse",
			ПредставлениеСсылки(Выборка.Склад, Выборка.КодСклада, Выборка.НаименованиеСклада));

		СоставЗаказа = СоставыЗаказов.Получить(Выборка.Ссылка);
		Если СоставЗаказа = Неопределено Тогда
			СоставЗаказа = Новый Массив;
		КонецЕсли;
		СтруктураЗаказа.Вставить("items", СоставЗаказа);

		СтрокаСообщения.Ссылка = Выборка.Ссылка;
		СтрокаСообщения.Сообщение = ЗаписатьJSON_(СтруктураЗаказа);

	КонецЦикла;

КонецПроцедуры

// Возвращает составы заказов, прошедших маршрутизацию.
//
// Параметры:
//  Контекст - ФиксированнаяСтруктура - контекст выполнения конвейера.
//
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - ДокументСсылка.Демо_Заказ - заказ.
//   * Значение - Массив из Структура - строки состава заказа.
Функция ПолучитьСоставыЗаказов(Контекст)

	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = Контекст.Выполнение.МенеджерВременныхТаблиц;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	Товары.Ссылка КАК Ссылка,
		|	Товары.НомерСтроки КАК НомерСтроки,
		|	Товары.Товар КАК Товар,
		|	Номенклатура.Код КАК КодТовара,
		|	Номенклатура.Наименование КАК НаименованиеТовара,
		|	Товары.Количество КАК Количество
		|ИЗ
		|	Документ.Демо_Заказ.Товары КАК Товары
		|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ ВТ_СсылкиПоУзлам КАК Маршруты
		|		ПО Товары.Ссылка = Маршруты.Ссылка
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Демо_КОД_Товары КАК Номенклатура
		|		ПО Товары.Товар = Номенклатура.Ссылка
		|УПОРЯДОЧИТЬ ПО
		|	Ссылка,
		|	НомерСтроки";

	СоставыЗаказов = Новый Соответствие;
	Выборка = Запрос.Выполнить().Выбрать();

	Пока Выборка.Следующий() Цикл

		СоставЗаказа = СоставыЗаказов.Получить(Выборка.Ссылка);
		Если СоставЗаказа = Неопределено Тогда
			СоставЗаказа = Новый Массив;
			СоставыЗаказов.Вставить(Выборка.Ссылка, СоставЗаказа);
		КонецЕсли;

		СтрокаТовара = Новый Структура;
		СтрокаТовара.Вставить("line_number", Выборка.НомерСтроки);
		СтрокаТовара.Вставить(
			"product",
			ПредставлениеСсылки(Выборка.Товар, Выборка.КодТовара, Выборка.НаименованиеТовара));
		СтрокаТовара.Вставить("quantity", Выборка.Количество);
		СоставЗаказа.Добавить(СтрокаТовара);

	КонецЦикла;

	Возврат СоставыЗаказов;

КонецФункции

// Возвращает представление ссылочного значения для сообщения JSON.
//
// Параметры:
//  Ссылка - СправочникСсылка.Демо_КОД_СкладыХранения,
//           СправочникСсылка.Демо_КОД_Товары - представляемое значение.
//  Код - Строка - код значения.
//  Наименование - Строка - наименование значения.
//
// Возвращаемое значение:
//  Структура, Null - идентификатор, код и наименование ссылочного значения.
Функция ПредставлениеСсылки(Ссылка, Код, Наименование)

	Если Не ЗначениеЗаполнено(Ссылка) Тогда
		Возврат Null;
	КонецЕсли;

	Результат = Новый Структура;
	Результат.Вставить("guid", Ссылка.УникальныйИдентификатор());
	Результат.Вставить("code", Код);
	Результат.Вставить("name", Наименование);

	Возврат Результат;

КонецФункции

// Сериализует значение в строку JSON.
//
// Параметры:
//  Значение - Произвольный - сериализуемое значение.
//  ПараметрыЗаписи - ПараметрыЗаписиJSON, Неопределено - параметры записи JSON.
//
// Возвращаемое значение:
//  Строка - представление значения в формате JSON.
Функция ЗаписатьJSON_(Значение, ПараметрыЗаписи = Неопределено)

	Если ПараметрыЗаписи = Неопределено Тогда
		ПараметрыЗаписи = Новый ПараметрыЗаписиJSON(ПереносСтрокJSON.Нет);
	КонецЕсли;

	ЗаписьJSON = Новый ЗаписьJSON;
	ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписи);

	ЗаписатьJSON(ЗаписьJSON, Значение, , "ПреобразованиеJSON", ЭтотОбъект);

	Возврат ЗаписьJSON.Закрыть();

КонецФункции

// Преобразует значение при сериализации в JSON.
//
// Параметры:
//  Свойство - Строка - имя сериализуемого свойства.
//  Значение - Произвольный - сериализуемое значение.
//  ДопПараметры - Произвольный - дополнительные параметры преобразования.
//  Отказ - Булево - признак отказа от стандартного преобразования.
//
// Возвращаемое значение:
//  Строка - строковое представление значения.
Функция ПреобразованиеJSON(Знач Свойство, Значение, ДопПараметры, Отказ) Экспорт

	Возврат XMLСтрока(Значение);

КонецФункции

// Передает сформированный выход следующему обработчику цепочки.
// В режиме отладки сохраняет выход в контексте без продолжения цепочки.
//
// Параметры:
//  Контекст - ФиксированнаяСтруктура - контекст выполнения конвейера.
//  Выход - Произвольный - результат текущего обработчика.
Процедура ПередатьДругому(Контекст, Выход = Неопределено)

	Если Контекст.Выполнение.Режим = "Отладка" Тогда
		Контекст.Данные.ВыходыОтладки.Добавить(Выход);
		Возврат;
	КонецЕсли;

	Если СледующийОбработчик = Неопределено Тогда
		Возврат;
	КонецЕсли;

	СледующийОбработчик.Обработать(Контекст, Выход);

КонецПроцедуры

#КонецОбласти
